--MisDescBegin
--脚本号
x210247_g_ScriptId 						= 210247

--接受任务NPC属性
x210247_g_Position_X 					= 172.7304
x210247_g_Position_Z 					= 146.4640
x210247_g_SceneID 						= 2
x210247_g_AccomplishNPC_Name	= "孙八爷"
--任务号
x210247_g_MissionId 					= 1152
--目标NPC
x210247_g_Name 								= "孙八爷"
--任务归类
x210247_g_MissionKind 				= 13
--任务环数
--MD_LABORISGLORIOUS_ROUND（288）
x210247_g_MissionRound				= 288
--任务等级
x210247_g_MissionLevel 				= 10000
--是否是精英任务
x210247_g_IfMissionElite 			= 0
--是否完成
x210247_g_IsMissionOkFail			= 0		
--任务名
x210247_g_MissionName 				= "劳动最光荣"
--任务描述
x210247_g_MissionInfo					= ""

--任务目标
x210247_g_MissionTarget				= "%f"

x210247_g_StrForePart 				= 4

--x210247_g_FormatList 					= {"#{WYHD_090410_28}%s#{WYHD_090410_29}",}
x210247_g_FormatList 					= {"大理的%s#W请你帮阿朱抓一只%s来。#r小提示：#r洛阳城的%s#W可以送你去玄武岛，你可以在玄武岛上捕捉我需要的珍兽。#r#G注意：这个活动每天只可以参加一次，并且放弃任务今天就不可以再参加劳动最光荣任务了。",}
x210247_g_StrList 						= {
 "#R孙八爷#W#{_INFOAIM173,146,2,孙八爷}",
 "#R云涵儿#W#{_INFOAIM182,155,0,云涵儿}",
 ----------------------------------------------
 "成年浣熊 (玄武岛#{_INFOAIM115,122,112,})",
 "成年狼 (玄武岛#{_INFOAIM200,162,112,})",
 "成年松鼠 (玄武岛#{_INFOAIM175,128,112,})",
 "成年鹦鹉 (玄武岛#{_INFOAIM153,157,112,})",
 "成年蝙蝠 (玄武岛#{_INFOAIM228,166,112,})",
 "成年大螳螂 (玄武岛#{_INFOAIM59,151,112,})",
 "成年鳄鱼 (玄武岛#{_INFOAIM68,121,112,})",
 "成年蜥蜴 (玄武岛#{_INFOAIM101,155,112,})",
 "成年獾 (玄武岛#{_INFOAIM62,256,112,})",
 "成年老虎 (玄武岛#{_INFOAIM96,254,112,})",
 "成年猫头鹰 (玄武岛#{_INFOAIM61,218,112,})",
 "成年野猪 (玄武岛#{_INFOAIM127,254,112,})",
 "成年豹子 (玄武岛#{_INFOAIM250,236,112,})",
 "成年冰蚕 (玄武岛#{_INFOAIM192,232,112,})",
 "成年鸵鸟 (玄武岛#{_INFOAIM181,268,112,})",
 "成年鹰 (玄武岛#{_INFOAIM216,270,112,})",
 "成年北极熊 (玄武岛#{_INFOAIM216,223,112,})",
 "成年大猩猩 (玄武岛#{_INFOAIM276,121,112,})",
 "成年剑齿虎 (玄武岛#{_INFOAIM285,149,112,})",
 "成年孔雀 (玄武岛#{_INFOAIM263,166,112,})",
 "成年駮马 (玄武岛#{_INFOAIM247,98,112,})",
 "成年剑龙 (玄武岛#{_INFOAIM275,85,112,})",
 "成年犀牛 (玄武岛#{_INFOAIM227,92,112,})",
 "成年豹子 (玄武岛#{_INFOAIM250,236,112,})",
 "成年冰蚕 (玄武岛#{_INFOAIM192,232,112,})",
 "成年鸵鸟 (玄武岛#{_INFOAIM181,268,112,})",
 "成年鹰 (玄武岛#{_INFOAIM216,270,112,})",
 "成年北极熊 (玄武岛#{_INFOAIM216,223,112,})",
 "成年大猩猩 (玄武岛#{_INFOAIM276,121,112,})",
 "成年剑齿虎 (玄武岛#{_INFOAIM285,149,112,})",
 "成年孔雀 (玄武岛#{_INFOAIM263,166,112,})",
 "成年獾 (玄武岛#{_INFOAIM62,256,112,})",
 "成年老虎 (玄武岛#{_INFOAIM96,254,112,})",
 "成年猫头鹰 (玄武岛#{_INFOAIM61,218,112,})",
 "成年野猪 (玄武岛#{_INFOAIM127,254,112,})",
 "成年蜥蜴 (玄武岛#{_INFOAIM101,155,112,})",
 "成年蝙蝠 (玄武岛#{_INFOAIM228,166,112,})",
 "成年大螳螂 (玄武岛#{_INFOAIM59,151,112,})",
 "成年鳄鱼 (玄武岛#{_INFOAIM68,121,112,})",
 }

 --控制脚本
x210247_g_ControlScript				= 210247
--任务完成情况,内容动态刷新,占用任务参数的第1位
x210247_g_Custom							= { {id="已捕捉珍兽",num=1}}


--MisDescEnd
