--MisDescBegin
x050075_g_ScriptId = 050075
x050075_g_KDZZID = 1006000004
--任务号
x050075_g_MissionId = 1182


--任务归类
x050075_g_MissionKind = 12

--任务等级
x050075_g_MissionLevel = 10000

--是否是精英任务
x050075_g_IfMissionElite = 0


--任务名
x050075_g_MissionName="#{SXGS_091105_22}"

x050075_g_MissionTarget="%f"

x050075_g_MissionFinishType = 3
x050075_g_StrForePart = 4

x050075_g_FormatList = {"%s%s%s",}

x050075_g_StrList = {
	  "#{SXGS_091105_24}",
    "成年猴子#{_INFOAIM203,69,112,}",	--3050
		"成年狗#{_INFOAIM234,57,112,}",	--3030
		"成年刺猬#{_INFOAIM139,111,112,}",	--3040
    "成年浣熊#{_INFOAIM115,122,112,}",--3070
		"成年松鼠#{_INFOAIM175,128,112,}",	--3060
		"成年鹦鹉#{_INFOAIM153,157,112,}",	--3080
		"成年蝙蝠#{_INFOAIM228,166,112,}",	--3100
		"成年大螳螂#{_INFOAIM59,151,112,}",	--3110
		"成年蜥蜴#{_INFOAIM101,155,112,}",	--3090
		"成年獾#{_INFOAIM62,256,112,}",--3140
		"成年老虎#{_INFOAIM96,254,112,}",	--3150
		"成年猫头鹰#{_INFOAIM61,218,112,}",	--3130
		"成年野猪#{_INFOAIM127,254,112,}",	--3160
    "成年豹子#{_INFOAIM250,236,112,}",	--3200
		"成年冰蚕#{_INFOAIM192,232,112,}",	--3170
		"成年鸵鸟#{_INFOAIM181,268,112,}",	--3190
		"成年鹰#{_INFOAIM216,270,112,}",	--3180
    "成年北极熊#{_INFOAIM216,223,112,}",	--3210
		"成年大猩猩#{_INFOAIM276,121,112,}",	--3240
		"成年剑齿虎#{_INFOAIM285,149,112,}",	--3230
		"成年孔雀#{_INFOAIM263,166,112,}",	--3220
    "成年駮马#{_INFOAIM247,98,112,}",	--3280
		"成年剑龙#{_INFOAIM275,85,112,}",	--3270
		"成年犀牛#{_INFOAIM227,92,112,}",	--3250
		"成年豹子#{_INFOAIM250,236,112,}",	--3200
		"成年冰蚕#{_INFOAIM192,232,112,}",	--3170
		"成年鸵鸟#{_INFOAIM181,268,112,}",	--3190
		"成年鹰#{_INFOAIM216,270,112,}",	--3180
		"成年北极熊#{_INFOAIM216,223,112,}",	--3210
		"成年大猩猩#{_INFOAIM276,121,112,}",	--3240
		"成年剑齿虎#{_INFOAIM285,149,112,}",	--3230
		"成年孔雀#{_INFOAIM263,166,112,}",	--3220
		"成年獾#{_INFOAIM62,256,112,}",	--3140
		"成年老虎#{_INFOAIM96,254,112,}",	--3150
		"成年猫头鹰#{_INFOAIM61,218,112,}",	--3130
		"成年野猪#{_INFOAIM127,254,112,}",	--3160
		"成年蜥蜴#{_INFOAIM101,155,112,}",	--3090
		"成年蝙蝠#{_INFOAIM228,166,112,}",	--3100
		"成年大螳螂#{_INFOAIM59,151,112,}",	--3110
		"成年鳄鱼#{_INFOAIM68,121,112,}",	--3120
		"#{SXGS_091105_25}",   
	}

x050075_g_IsMissionOkFail = 0
x050075_g_Custom = {{id = "准备新年礼物",num = 1}}

--完成任务NPC属性
x050075_g_Position_X=87
x050075_g_Position_Z=140
x050075_g_SceneID=1
x050075_g_AccomplishNPC_Name="艾虎"


--MisDescEnd
